APIServer/file_upload_api/app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles"